views/client/_form.php


        } ?>*/

$types = Type::find()->all();
---
SELECT * FROM `type`