controllers/ClientController.php

    public function actionCreate()
    {
        $model = new Client();
        $count = count(Yii::$app->request->post('Address', []));
        $model2 = [new Address(['scenario' => Address::SCENARIO_BATCH_UPDATE])];

        for($i = 1; $i < $count; $i++) {
            $model2[] = new Address(['scenario' => Address::SCENARIO_BATCH_UPDATE]);
            }
        if(isset($_POST['submit']) && $_POST['submit']=='true') {
            $model->load(Yii::$app->request->post());
            $model2[] = new Address(['scenario' => Address::SCENARIO_BATCH_UPDATE]);

            return $this->render('create', [
                'model' => $model,
                'model2' => $model2
            ]);
        }

        if (($model->load(Yii::$app->request->post()) && $model->validate()) && (Model::loadMultiple($model2, Yii::$app->request->post()) &&
            Model::validateMultiple($model2))) {
                $model->save(false);

                foreach ($model2 as $modelAddress) {
                    $modelAddress->client_id = $model->id;
                    $modelAddress->save(false);
---
INSERT INTO `client` (`nome`, `e_mail`, `rg`) VALUES ('Jeremias do Nascimento', 'ladraodelivros@algo.com', 29394032)
INSERT INTO `address` (`id`, `street`, `number`, `neighborhood`, `type_id`, `active`, `client_id`) VALUES (NULL, 'weeqweqwe', 999999, 'asdffsdf', 2, 1, 176)

    public function actionUpdate($id)
    {
        $model = Client::findOne($id);
        $model2= Address::findAll(['client_id' => $id]);
        $count = count(Yii::$app->request->post('Address',[]));

        for($i = 0; $i < $count; $i++) {
            if(!isset($model2[$i])){
                $model2[] = new Address(['scenario' => Address::SCENARIO_BATCH_UPDATE]);
            } else {
                $model2[$i]->setScenario(Address::SCENARIO_BATCH_UPDATE);
            }
        }

        if(isset($_POST['submit']) && $_POST['submit']=='true') {
                $model->load(Yii::$app->request->post());
                $model2[] = new Address(['scenario' => Address::SCENARIO_BATCH_UPDATE]);

                return $this->render('update', [
                    'model' => $model,
                    'model2' => $model2
                ]);
            }

        if(($model->load(Yii::$app->request->post()) && $model->validate())){
            $model->save();
            if(Model::loadMultiple($model2, Yii::$app->request->post()) && Model::validateMultiple($model2)){
                foreach ($model2 as $modelAddress) {
                    if ($modelAddress->updateType == Address::UPDATE_TYPE_DELETE) {
                        $modelAddress->delete();
                    } else {
                            $modelAddress->client_id = $model->id;
                            $modelAddress->save(false);
---
SELECT * FROM `client` WHERE `id`='177'
SELECT * FROM `address` WHERE `client_id`='177'
SELECT * FROM `client` WHERE `id`='176'
SELECT * FROM `address` WHERE `client_id`='176'
UPDATE `client` SET `rg`=29394032 WHERE `id`=177
UPDATE `address` SET `id`=108, `number`=312, `active`=1, `type_id`=2 WHERE `id`=108
DELETE FROM `address` WHERE `id`=109
INSERT INTO `address` (`id`, `street`, `number`, `neighborhood`, `type_id`, `active`, `client_id`) VALUES (NULL, 'Alola2242', 220, 'dkoqoqwdokqwda5555ok', 3, 0, 177)

    public function actionDelete($id)
    {
        $model = Client::findOne($id);
        $model2 = Address::findAll(['client_id' => $id]);

        foreach ($model2 as $modelAddress) {
            $modelAddress->delete();
---
SELECT * FROM `client` WHERE `id`='35'
SELECT * FROM `address` WHERE `client_id`='35'
DELETE FROM `address` WHERE `id`=107